GetDirectContext3DHandleOverrides Method
 Returns DirectContext3D handle overrides object for the view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  Since:  2018
 Syntax
  C#
public DirectContext3DHandleOverrides GetDirectContext3DHandleOverrides()
  Visual Basic
Public Function GetDirectContext3DHandleOverrides As DirectContext3DHandleOverrides
  Visual C++
public:
DirectContext3DHandleOverrides^ GetDirectContext3DHandleOverrides()
 Return Value
 DirectContext3D handle overrides for the view
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →